SecurityEvent
| where EventID == 4688
| where (IntegrityLevel == "System" and (User contains "AUTHORI" or User contains "AUTORI")) and ((Image endswith "\\calc.exe" or Image endswith "\\wscript.exe" or Image endswith "\\cscript.exe" or Image endswith "\\hh.exe" or Image endswith "\\mshta.exe" or Image endswith "\\forfiles.exe" or Image endswith "\\ping.exe") or (CommandLine contains " -NoP " or CommandLine contains " -W Hidden " or CommandLine contains " -decode " or CommandLine contains " /decode " or CommandLine contains " /urlcache " or CommandLine contains " -urlcache " or CommandLine contains " -e* JAB" or CommandLine contains " -e* SUVYI" or CommandLine contains " -e* SQBFAFgA" or CommandLine contains " -e* aWV4I" or CommandLine contains " -e* IAB" or CommandLine contains " -e* PAA" or CommandLine contains " -e* aQBlAHgA" or CommandLine contains "vssadmin delete shadows" or CommandLine contains "reg SAVE HKLM" or CommandLine contains " -ma " or CommandLine contains "Microsoft\\Windows\\CurrentVersion\\Run" or CommandLine contains ".downloadstring(" or CommandLine contains ".downloadfile(" or CommandLine contains " /ticket:" or CommandLine contains "dpapi::" or CommandLine contains "event::clear" or CommandLine contains "event::drop" or CommandLine contains "id::modify" or CommandLine contains "kerberos::" or CommandLine contains "lsadump::" or CommandLine contains "misc::" or CommandLine contains "privilege::" or CommandLine contains "rpc::" or CommandLine contains "sekurlsa::" or CommandLine contains "sid::" or CommandLine contains "token::" or CommandLine contains "vault::cred" or CommandLine contains "vault::list" or CommandLine contains " p::d " or CommandLine contains ";iex(" or CommandLine contains "MiniDump" or CommandLine contains "net user "))
